#Условие
#Шахматный король ходит по горизонтали, вертикали и диагонали, но только на 1 клетку. Даны две различные клетки шахматной доски, 
#определите, может ли король попасть с первой клетки на вторую одним ходом. Программа получает на вход четыре числа от 1 до 8 каждое,
#задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки. Программа должна вывести YES,
#если из первой клетки ходом короля можно попасть во вторую или NO в противном случае.

#Ввод данных
st1 = int(input())
str1 = int(input())
st2 = int(input())
str2 = int(input())

if (st1 - 1 <= st2 <= st1 + 1) and (str1 - 1 <= str2 <= str1 + 1):
    print('YES')
else:
    print('NO')
