#Словари
#Задача «Права доступа»
#Условие
#В файловую систему одного суперкомпьютера проник вирус, который сломал контроль за правами доступа к файлам. Для каждого файла известно, с какими действиями можно к нему обращаться:

#запись W,
#чтение R,
#запуск X.
#В первой строке содержится число N — количество файлов содержащихся в данной файловой системе. В следующих N строчках содержатся имена файлов и допустимых с ними операций, разделенные пробелами. Далее указано чиcло M — количество запросов к файлам. В последних M строках указан запрос вида Операция Файл. К одному и тому же файлу может быть применено любое колличество запросов.

#Вам требуется восстановить контроль над правами доступа к файлам (ваша программа для каждого запроса должна будет возвращать OK если над файлом выполняется допустимая операция, или же Access denied, если операция недопустима.


RWX_D = {
    'read': 'R',
    'write': 'W',
    'execute': 'X',
}

n = int(input()) #количество файлов
fs = {} #словарь fs
for i in range(n):
    file = input().split(' ') 
    fs[file[0]] = file[1::1]
        
m  = int(input())#количество запросов к файлу
for i in range(m): #
    query, f = input().split(' ') #запрос
    if f in fs:
        if RWX_D[query] in fs[f]:
            print('OK')
        else:
            print('Access denied')
  
  